app/controllers/songs_controller.rb

  def index
    if params[:artist_id] && Artist.find_by_id(params[:artist_id])
      #binding.pry
      @songs = Artist.find_by_id(params[:artist_id]).songs
    elsif params[:artist_id]
      redirect_to artists_path
      flash.alert = "Artist not found."
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
SELECT "songs".* FROM "songs"

  def show
    @song = Song.find_by_id(params[:id])
    @artist = Artist.find_by_id(@song.artist_id)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 3]]